docs/benchmark/runs/sanity-e2e-10rps-warmcapacity-20260531225832/k6-output.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: tests/k6/baseline-e2e-10rps.js
        output: -

     scenarios: (100.00%) 1 scenario, 60 max VUs, 1m30s max duration (incl. graceful stop):
              * baseline_e2e_10rps: 10.00 iterations/s for 1m0s (maxVUs: 20-60, gracefulStop: 30s)


running (0m01.0s), 06/20 VUs, 4 complete and 0 interrupted iterations
baseline_e2e_10rps   [   2% ] 06/20 VUs  0m01.0s/1m0s  10.00 iters/s

running (0m02.0s), 02/20 VUs, 18 complete and 0 interrupted iterations
baseline_e2e_10rps   [   3% ] 02/20 VUs  0m02.0s/1m0s  10.00 iters/s

running (0m03.0s), 01/20 VUs, 29 complete and 0 interrupted iterations
baseline_e2e_10rps   [   5% ] 01/20 VUs  0m03.0s/1m0s  10.00 iters/s

running (0m04.0s), 01/20 VUs, 39 complete and 0 interrupted iterations
baseline_e2e_10rps   [   7% ] 01/20 VUs  0m04.0s/1m0s  10.00 iters/s

running (0m05.0s), 04/20 VUs, 46 complete and 0 interrupted iterations
baseline_e2e_10rps   [   8% ] 04/20 VUs  0m05.0s/1m0s  10.00 iters/s

running (0m06.0s), 01/20 VUs, 59 complete and 0 interrupted iterations
baseline_e2e_10rps   [  10% ] 01/20 VUs  0m06.0s/1m0s  10.00 iters/s

running (0m07.0s), 02/20 VUs, 68 complete and 0 interrupted iterations
baseline_e2e_10rps   [  12% ] 02/20 VUs  0m07.0s/1m0s  10.00 iters/s

running (0m08.0s), 02/20 VUs, 78 complete and 0 interrupted iterations
baseline_e2e_10rps   [  13% ] 02/20 VUs  0m08.0s/1m0s  10.00 iters/s

running (0m09.0s), 01/20 VUs, 89 complete and 0 interrupted iterations
baseline_e2e_10rps   [  15% ] 01/20 VUs  0m09.0s/1m0s  10.00 iters/s

running (0m10.0s), 01/20 VUs, 99 complete and 0 interrupted iterations
baseline_e2e_10rps   [  17% ] 01/20 VUs  0m10.0s/1m0s  10.00 iters/s

running (0m11.0s), 01/20 VUs, 109 complete and 0 interrupted iterations
baseline_e2e_10rps   [  18% ] 01/20 VUs  0m11.0s/1m0s  10.00 iters/s

running (0m12.0s), 01/20 VUs, 119 complete and 0 interrupted iterations
baseline_e2e_10rps   [  20% ] 01/20 VUs  0m12.0s/1m0s  10.00 iters/s

running (0m13.0s), 01/20 VUs, 129 complete and 0 interrupted iterations
baseline_e2e_10rps   [  22% ] 01/20 VUs  0m13.0s/1m0s  10.00 iters/s

running (0m14.0s), 02/20 VUs, 138 complete and 0 interrupted iterations
baseline_e2e_10rps   [  23% ] 02/20 VUs  0m14.0s/1m0s  10.00 iters/s

running (0m15.0s), 02/20 VUs, 148 complete and 0 interrupted iterations
baseline_e2e_10rps   [  25% ] 02/20 VUs  0m15.0s/1m0s  10.00 iters/s

running (0m16.0s), 01/20 VUs, 159 complete and 0 interrupted iterations
baseline_e2e_10rps   [  27% ] 01/20 VUs  0m16.0s/1m0s  10.00 iters/s

running (0m17.0s), 03/20 VUs, 167 complete and 0 interrupted iterations
baseline_e2e_10rps   [  28% ] 03/20 VUs  0m17.0s/1m0s  10.00 iters/s

running (0m18.0s), 01/20 VUs, 179 complete and 0 interrupted iterations
baseline_e2e_10rps   [  30% ] 01/20 VUs  0m18.0s/1m0s  10.00 iters/s

running (0m19.0s), 01/20 VUs, 189 complete and 0 interrupted iterations
baseline_e2e_10rps   [  32% ] 01/20 VUs  0m19.0s/1m0s  10.00 iters/s

running (0m20.0s), 01/20 VUs, 199 complete and 0 interrupted iterations
baseline_e2e_10rps   [  33% ] 01/20 VUs  0m20.0s/1m0s  10.00 iters/s

running (0m21.0s), 01/20 VUs, 209 complete and 0 interrupted iterations
baseline_e2e_10rps   [  35% ] 01/20 VUs  0m21.0s/1m0s  10.00 iters/s

running (0m22.0s), 01/20 VUs, 219 complete and 0 interrupted iterations
baseline_e2e_10rps   [  37% ] 01/20 VUs  0m22.0s/1m0s  10.00 iters/s

running (0m23.0s), 02/20 VUs, 228 complete and 0 interrupted iterations
baseline_e2e_10rps   [  38% ] 02/20 VUs  0m23.0s/1m0s  10.00 iters/s

running (0m24.0s), 02/20 VUs, 238 complete and 0 interrupted iterations
baseline_e2e_10rps   [  40% ] 02/20 VUs  0m24.0s/1m0s  10.00 iters/s

running (0m25.0s), 04/20 VUs, 246 complete and 0 interrupted iterations
baseline_e2e_10rps   [  42% ] 04/20 VUs  0m25.0s/1m0s  10.00 iters/s

running (0m26.0s), 06/20 VUs, 254 complete and 0 interrupted iterations
baseline_e2e_10rps   [  43% ] 06/20 VUs  0m26.0s/1m0s  10.00 iters/s

running (0m27.0s), 03/20 VUs, 267 complete and 0 interrupted iterations
baseline_e2e_10rps   [  45% ] 03/20 VUs  0m27.0s/1m0s  10.00 iters/s

running (0m28.0s), 05/20 VUs, 275 complete and 0 interrupted iterations
baseline_e2e_10rps   [  47% ] 05/20 VUs  0m28.0s/1m0s  10.00 iters/s

running (0m29.0s), 05/20 VUs, 285 complete and 0 interrupted iterations
baseline_e2e_10rps   [  48% ] 05/20 VUs  0m29.0s/1m0s  10.00 iters/s

running (0m30.0s), 04/20 VUs, 296 complete and 0 interrupted iterations
baseline_e2e_10rps   [  50% ] 04/20 VUs  0m30.0s/1m0s  10.00 iters/s

running (0m31.0s), 01/20 VUs, 309 complete and 0 interrupted iterations
baseline_e2e_10rps   [  52% ] 01/20 VUs  0m31.0s/1m0s  10.00 iters/s

running (0m32.0s), 01/20 VUs, 319 complete and 0 interrupted iterations
baseline_e2e_10rps   [  53% ] 01/20 VUs  0m32.0s/1m0s  10.00 iters/s

running (0m33.0s), 03/20 VUs, 327 complete and 0 interrupted iterations
baseline_e2e_10rps   [  55% ] 03/20 VUs  0m33.0s/1m0s  10.00 iters/s

running (0m34.0s), 01/20 VUs, 339 complete and 0 interrupted iterations
baseline_e2e_10rps   [  57% ] 01/20 VUs  0m34.0s/1m0s  10.00 iters/s

running (0m35.0s), 01/20 VUs, 349 complete and 0 interrupted iterations
baseline_e2e_10rps   [  58% ] 01/20 VUs  0m35.0s/1m0s  10.00 iters/s

running (0m36.0s), 01/20 VUs, 359 complete and 0 interrupted iterations
baseline_e2e_10rps   [  60% ] 01/20 VUs  0m36.0s/1m0s  10.00 iters/s

running (0m37.0s), 01/20 VUs, 369 complete and 0 interrupted iterations
baseline_e2e_10rps   [  62% ] 01/20 VUs  0m37.0s/1m0s  10.00 iters/s

running (0m38.0s), 02/20 VUs, 378 complete and 0 interrupted iterations
baseline_e2e_10rps   [  63% ] 02/20 VUs  0m38.0s/1m0s  10.00 iters/s

running (0m39.0s), 01/20 VUs, 389 complete and 0 interrupted iterations
baseline_e2e_10rps   [  65% ] 01/20 VUs  0m39.0s/1m0s  10.00 iters/s

running (0m40.0s), 01/20 VUs, 399 complete and 0 interrupted iterations
baseline_e2e_10rps   [  67% ] 01/20 VUs  0m40.0s/1m0s  10.00 iters/s

running (0m41.0s), 01/20 VUs, 409 complete and 0 interrupted iterations
baseline_e2e_10rps   [  68% ] 01/20 VUs  0m41.0s/1m0s  10.00 iters/s

running (0m42.0s), 01/20 VUs, 419 complete and 0 interrupted iterations
baseline_e2e_10rps   [  70% ] 01/20 VUs  0m42.0s/1m0s  10.00 iters/s

running (0m43.0s), 03/20 VUs, 427 complete and 0 interrupted iterations
baseline_e2e_10rps   [  72% ] 03/20 VUs  0m43.0s/1m0s  10.00 iters/s

running (0m44.0s), 02/20 VUs, 438 complete and 0 interrupted iterations
baseline_e2e_10rps   [  73% ] 02/20 VUs  0m44.0s/1m0s  10.00 iters/s

running (0m45.0s), 06/20 VUs, 444 complete and 0 interrupted iterations
baseline_e2e_10rps   [  75% ] 06/20 VUs  0m45.0s/1m0s  10.00 iters/s

running (0m46.0s), 01/20 VUs, 459 complete and 0 interrupted iterations
baseline_e2e_10rps   [  77% ] 01/20 VUs  0m46.0s/1m0s  10.00 iters/s

running (0m47.0s), 02/20 VUs, 468 complete and 0 interrupted iterations
baseline_e2e_10rps   [  78% ] 02/20 VUs  0m47.0s/1m0s  10.00 iters/s

running (0m48.0s), 01/20 VUs, 479 complete and 0 interrupted iterations
baseline_e2e_10rps   [  80% ] 01/20 VUs  0m48.0s/1m0s  10.00 iters/s

running (0m49.0s), 01/20 VUs, 489 complete and 0 interrupted iterations
baseline_e2e_10rps   [  82% ] 01/20 VUs  0m49.0s/1m0s  10.00 iters/s

running (0m50.0s), 01/20 VUs, 499 complete and 0 interrupted iterations
baseline_e2e_10rps   [  83% ] 01/20 VUs  0m50.0s/1m0s  10.00 iters/s

running (0m51.0s), 04/20 VUs, 506 complete and 0 interrupted iterations
baseline_e2e_10rps   [  85% ] 04/20 VUs  0m51.0s/1m0s  10.00 iters/s

running (0m52.0s), 03/20 VUs, 517 complete and 0 interrupted iterations
baseline_e2e_10rps   [  87% ] 03/20 VUs  0m52.0s/1m0s  10.00 iters/s

running (0m53.0s), 05/20 VUs, 525 complete and 0 interrupted iterations
baseline_e2e_10rps   [  88% ] 05/20 VUs  0m53.0s/1m0s  10.00 iters/s

running (0m54.0s), 06/20 VUs, 534 complete and 0 interrupted iterations
baseline_e2e_10rps   [  90% ] 06/20 VUs  0m54.0s/1m0s  10.00 iters/s

running (0m55.0s), 07/20 VUs, 543 complete and 0 interrupted iterations
baseline_e2e_10rps   [  92% ] 07/20 VUs  0m55.0s/1m0s  10.00 iters/s

running (0m56.0s), 05/20 VUs, 555 complete and 0 interrupted iterations
baseline_e2e_10rps   [  93% ] 05/20 VUs  0m56.0s/1m0s  10.00 iters/s

running (0m57.0s), 05/20 VUs, 565 complete and 0 interrupted iterations
baseline_e2e_10rps   [  95% ] 05/20 VUs  0m57.0s/1m0s  10.00 iters/s

running (0m58.0s), 06/20 VUs, 574 complete and 0 interrupted iterations
baseline_e2e_10rps   [  97% ] 06/20 VUs  0m58.0s/1m0s  10.00 iters/s

running (0m59.0s), 02/20 VUs, 588 complete and 0 interrupted iterations
baseline_e2e_10rps   [  98% ] 02/20 VUs  0m59.0s/1m0s  10.00 iters/s

running (1m00.0s), 02/20 VUs, 598 complete and 0 interrupted iterations
baseline_e2e_10rps   [ 100% ] 02/20 VUs  1m00.0s/1m0s  10.00 iters/s


  █ THRESHOLDS 

    http_req_duration
    ✓ 'p(95)<1500' p(95)=623.86ms

    http_req_failed
    ✓ 'rate<0.01' rate=0.00%

    unexpected_error_rate
    ✓ 'rate<0.01' rate=0.00%


  █ TOTAL RESULTS 

    checks_total.......: 600     9.977508/s
    checks_succeeded...: 100.00% 600 out of 600
    checks_failed......: 0.00%   0 out of 600

    ✓ order request accepted or rejected

    CUSTOM
    accepted_orders................: 600    9.977508/s
    unexpected_error_rate..........: 0.00%  0 out of 600

    HTTP
    http_req_duration..............: avg=182.47ms min=16.36ms  med=126.13ms max=1.31s p(90)=430.26ms p(95)=623.86ms
      { expected_response:true }...: avg=182.47ms min=16.36ms  med=126.13ms max=1.31s p(90)=430.26ms p(95)=623.86ms
    http_req_failed................: 0.00%  0 out of 600
    http_reqs......................: 600    9.977508/s

    EXECUTION
    iteration_duration.............: avg=283.66ms min=117.27ms med=227.06ms max=1.42s p(90)=533.16ms p(95)=724.53ms
    iterations.....................: 600    9.977508/s
    vus............................: 2      min=1        max=7 
    vus_max........................: 20     min=20       max=20

    NETWORK
    data_received..................: 510 kB 8.5 kB/s
    data_sent......................: 287 kB 4.8 kB/s



running (1m00.1s), 00/20 VUs, 600 complete and 0 interrupted iterations
baseline_e2e_10rps ✓ [ 100% ] 00/20 VUs  1m0s  10.00 iters/s